RIET/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/ВидыОперацийРеализацияТоваров/ВидыОперацийРеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРеализацияТоваров</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПродажаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>КредитНотаСторно</name>
  </enumValues>
  <enumValues>
    <name>КредитНотаОтрицатСФ</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяКредитНота</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>РеализацияАгент</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаНалоговыеРегистры</name>
  </enumValues>
  <enumValues>
    <name>УполномоченныйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ПередачаОС/ПередачаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаОС</name>
  <comment>(Общ)</comment>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизации</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиВыручка_SB</registerRecords>
  <registerRecords>AccumulationRegister.КурсовыеРазницыSB</registerRecords>
  <registerRecords>AccumulationRegister.Выручка_SB</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленный</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ВнереализационныеДоходыИРасходы</registerRecords>
  <registerRecords>InformationRegister.СостоянияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВзаиморасчетовПоИнвойсам</registerRecords>
  <registerRecords>AccumulationRegister.РегистрСебестоимости</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьАмортизацияОС</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведения</registerRecords>
  <registerRecords>AccumulationRegister.ИсполнениеБюджетаКонтракта</registerRecords>
  <registerRecords>AccumulationRegister.РасходыБудущихПериодов</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</registerRecords>
  <attributes>
    <name>ЭтоДокументИнтеркомпани</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеОС</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокПодготовкаКПередачеОС</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключенВСтоимость</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоАвансам</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАдресДоставки</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоСдал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеДляСФ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИННКППГрузополучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКапитальныхВложенийВключаемыхВРасходыНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КостЦентр</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>РБП</name>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСРуб</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСРуб</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <attributes>
      <name>ДокументАванса</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/CommonModules/КонтрольПроведенияПереопределяемыйСервер/Module.bsl
////////////////////////////////////////////////////////
// В данном модуле содержатся функции, зависящие от
// структуры текущей ИБ
////////////////////////////////////////////////////////

Функция ПолучитьДанныеДокумента(СсылкаНаОбъект) Экспорт
	
	ДанныеДокумента = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	РезультатЗапроса = Неопределено;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.КредитНотаСторно)
			|			ТОГДА Док.Сделка.Дата
			|		ИНАЧЕ Док.Дата
			|	КОНЕЦ КАК Дата,
			|	ВЫБОР
			|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.КредитНотаСторно)
			|			ТОГДА Док.Сделка.Номер
			|		ИНАЧЕ Док.Номер
			|	КОНЕЦ КАК Номер,
			|	Док.Организация КАК ОрганизацияСсылка,
			|	Док.Организация.Наименование КАК ОрганизацияНаименование,
			|	Док.Организация.ИНН КАК ОрганизацияИНН,
			|	ВЫБОР
			|		КОГДА Док.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА Док.ПодразделениеОрганизации.КПП
			|		ИНАЧЕ Док.Организация.КПП
			|	КОНЕЦ КАК ОрганизацияКПП,
			|	Док.Контрагент КАК КонтрагентСсылка,
			|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
			|	Док.Контрагент.ИНН КАК КонтрагентИНН,
			|	Док.Контрагент.КПП КАК КонтрагентКПП,
			|	Док.ВалютаДокумента.Код КАК ВалютаКод,
			|	Док.ДоговорКонтрагента.Номер КАК ДоговорНомер,
			|	Док.ДоговорКонтрагента.Дата КАК ДоговорДата,
			|	Док.СуммаДокумента КАК СуммаДокумента,
			|	"""" КАК НомерВходящегоДокумента,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
			|	""Реализация"" КАК ТипДокумента
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыУслуги.Ссылка КАК Ссылка,
			|	ТоварыУслуги.НомерСтроки,
			|	ТоварыУслуги.НоменклатураНаименование,
			|	ТоварыУслуги.НоменклатураАртикул,
			|	ТоварыУслуги.НоменклатураКод,
			|	ТоварыУслуги.ЕдиницаИзмеренияНаименование,
			|	ТоварыУслуги.ЕдиницаИзмеренияКод,
			|	ТоварыУслуги.НомерГТД,
			|	ТоварыУслуги.Услуга,
			|	ТоварыУслуги.Количество КАК Количество,
			|	ТоварыУслуги.Цена,
			|	ТоварыУслуги.Сумма - ВЫБОР
			|		КОГДА ТоварыУслуги.СуммаВключаетНДС
			|			ТОГДА ТоварыУслуги.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаБезНДС,
			|	ТоварыУслуги.СуммаНДС КАК СуммаНДС,
			|	ТоварыУслуги.Сумма + ВЫБОР
			|		КОГДА ТоварыУслуги.СуммаВключаетНДС
			|			ТОГДА 0
			|		ИНАЧЕ ТоварыУслуги.СуммаНДС
			|	КОНЕЦ КАК Сумма,
			|	ТоварыУслуги.СтавкаНДС
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТЧ.Ссылка КАК Ссылка,
			|		ТЧ.НомерСтроки КАК НомерСтроки,
			|		ТЧ.Номенклатура.Наименование КАК НоменклатураНаименование,
			|		ТЧ.Номенклатура.Артикул КАК НоменклатураАртикул,
			|		ТЧ.Номенклатура.Код КАК НоменклатураКод,
			|		ВЫБОР
			|			КОГДА ТЧ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|				ТОГДА ТЧ.ЕдиницаИзмерения.Наименование
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|						ТОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование
			|					ИНАЧЕ ""шт""
			|				КОНЕЦ
			|		КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
			|		ВЫБОР
			|			КОГДА ТЧ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|				ТОГДА ТЧ.ЕдиницаИзмерения.Код
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|						ТОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код
			|					ИНАЧЕ ""796""
			|				КОНЕЦ
			|		КОНЕЦ КАК ЕдиницаИзмеренияКод,
			|		ТЧ.НомерГТД.Код КАК НомерГТД,
			|		""Т"" КАК Услуга,
			|		ТЧ.Количество КАК Количество,
			|		ТЧ.Цена КАК Цена,
			|		ТЧ.СуммаНДС КАК СуммаНДС,
			|		ТЧ.Сумма КАК Сумма,
			|		ТЧ.СтавкаНДС КАК СтавкаНДС,
			|		ТЧ.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
			|	ИЗ
			|		Документ.РеализацияТоваровУслуг.Товары КАК ТЧ
			|	ГДЕ
			|		ТЧ.Ссылка = &Ссылка
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТЧ.Ссылка,
			|		ТЧ.НомерСтроки,
			|		ТЧ.Номенклатура.Наименование,
			|		ТЧ.Номенклатура.Артикул,
			|		ТЧ.Номенклатура.Код,
			|		""шт"",
			|		""796"",
			|		"""",
			|		""У"",
			|		ТЧ.Количество,
			|		ТЧ.Цена,
			|		ТЧ.СуммаНДС,
			|		ТЧ.Сумма,
			|		ТЧ.СтавкаНДС,
			|		ТЧ.Ссылка.СуммаВключаетНДС
			|	ИЗ
			|		Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
			|	ГДЕ
			|		ТЧ.Ссылка = &Ссылка) КАК ТоварыУслуги";
			
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПередачаОС") Тогда
			
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка,
			|	Док.Дата КАК Дата,
			|	Док.Номер КАК Номер,
			|	Док.Организация КАК ОрганизацияСсылка,
			|	Док.Организация.Наименование КАК ОрганизацияНаименование,
			|	Док.Организация.ИНН КАК ОрганизацияИНН,
			|	ВЫБОР
			|		КОГДА Док.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА Док.ПодразделениеОрганизации.КПП
			|		ИНАЧЕ Док.Организация.КПП
			|	КОНЕЦ КАК ОрганизацияКПП,
			|	Док.Контрагент КАК КонтрагентСсылка,
			|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
			|	Док.Контрагент.ИНН КАК КонтрагентИНН,
			|	Док.Контрагент.КПП КАК КонтрагентКПП,
			|	Док.ВалютаДокумента.Код КАК ВалютаКод,
			|	Док.ДоговорКонтрагента.Номер КАК ДоговорНомер,
			|	Док.ДоговорКонтрагента.Дата КАК ДоговорДата,
			|	Док.СуммаДокумента КАК СуммаДокумента,
			|	"""" КАК НомерВходящегоДокумента,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
			|	""Реализация"" КАК ТипДокумента
			|ИЗ
			|	Документ.ПередачаОС КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЧ.Ссылка КАК Ссылка,
			|	ТЧ.НомерСтроки КАК НомерСтроки,
			|	ТЧ.ОсновноеСредство.Наименование КАК НоменклатураНаименование,
			|	"""" КАК НоменклатураАртикул,
			|	ТЧ.ОсновноеСредство.Код КАК НоменклатураКод,
			|	""шт"" КАК ЕдиницаИзмеренияНаименование,
			|	""796"" КАК ЕдиницаИзмеренияКод,
			|	"""" КАК НомерГТД,
			|	""Т"" КАК Услуга,
			|	1 КАК Количество,
			|	ТЧ.Сумма КАК Цена,
			|	ТЧ.Сумма - ВЫБОР
			|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
			|			ТОГДА ТЧ.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаБезНДС,
			|	ТЧ.СуммаНДС КАК СуммаНДС,
			|	ТЧ.Сумма + ВЫБОР
			|		КОГДА ТЧ.Ссылка.СуммаВключаетНДС
			|			ТОГДА 0
			|		ИНАЧЕ ТЧ.СуммаНДС
			|	КОНЕЦ КАК Сумма,
			|	ТЧ.СтавкаНДС КАК СтавкаНДС
			|ИЗ
			|	Документ.ПередачаОС.ОС КАК ТЧ
			|ГДЕ
			|	ТЧ.Ссылка = &Ссылка";
			
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ОтчетАгентаПоРасходам") Тогда
			
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Вознаграждение.Ссылка КАК Ссылка,
			|	Вознаграждение.Дата КАК Дата,
			|	Вознаграждение.Номер КАК Номер,
			|	Вознаграждение.Организация КАК ОрганизацияСсылка,
			|	Вознаграждение.Организация.Наименование КАК ОрганизацияНаименование,
			|	Вознаграждение.Организация.ИНН КАК ОрганизацияИНН,
			|	ВЫБОР
			|		КОГДА Вознаграждение.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА Вознаграждение.ПодразделениеОрганизации.КПП
			|		ИНАЧЕ Вознаграждение.Организация.КПП
			|	КОНЕЦ КАК ОрганизацияКПП,
			|	Вознаграждение.Контрагент КАК КонтрагентСсылка,
			|	Вознаграждение.Контрагент.Наименование КАК КонтрагентНаименование,
			|	Вознаграждение.Контрагент.ИНН КАК КонтрагентИНН,
			|	Вознаграждение.Контрагент.КПП КАК КонтрагентКПП,
			|	Вознаграждение.ВалютаДокумента.Код КАК ВалютаКод,
			|	Вознаграждение.ДоговорКонтрагента.Номер КАК ДоговорНомер,
			|	Вознаграждение.ДоговорКонтрагента.Дата КАК ДоговорДата,
			|	Вознаграждение.АгентскаяСумма + Вознаграждение.АгентскийНДС КАК СуммаДокумента,
			|	"""" КАК НомерВходящегоДокумента,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
			|	""Реализация"" КАК ТипДокумента,
			|	"""" КАК ИсхПоставщикНаименование,
			|	"""" КАК ИсхПоставщикИНН,
			|	"""" КАК ИсхПоставщикКПП,
			|	""Вознаграждение"" КАК УникальныйИдентификаторДоп
			|ИЗ
			|	Документ.ОтчетАгентаПоРасходам КАК Вознаграждение
			|ГДЕ
			|	Вознаграждение.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Расходы.Инвойс,
			|	Расходы.Ссылка.Дата,
			|	Расходы.Инвойс.ArInvoice,
			|	Расходы.Ссылка.Организация,
			|	Расходы.Ссылка.Организация.Наименование,
			|	Расходы.Ссылка.Организация.ИНН,
			|	ВЫБОР
			|		КОГДА Расходы.Ссылка.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|			ТОГДА Расходы.Ссылка.ПодразделениеОрганизации.КПП
			|		ИНАЧЕ Расходы.Ссылка.Организация.КПП
			|	КОНЕЦ,
			|	Расходы.Ссылка.Контрагент,
			|	Расходы.Ссылка.Контрагент.Наименование,
			|	Расходы.Ссылка.Контрагент.ИНН,
			|	Расходы.Ссылка.Контрагент.КПП,
			|	Расходы.Ссылка.ВалютаДокумента.Код,
			|	Расходы.Ссылка.ДоговорКонтрагента.Номер,
			|	Расходы.Ссылка.ДоговорКонтрагента.Дата,
			|	Расходы.Сумма + Расходы.СуммаНДС,
			|	"""",
			|	ДАТАВРЕМЯ(1, 1, 1),
			|	""Реализация"",
			|	ЕСТЬNULL(Расходы.Документ.Контрагент.Наименование, """"),
			|	ЕСТЬNULL(Расходы.Документ.Контрагент.ИНН, """"),
			|	ЕСТЬNULL(Расходы.Документ.Контрагент.КПП, """"),
			|	""""
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОтчетАгентаПоРасходамУслугиАгента.Ссылка КАК Ссылка,
			|		ОтчетАгентаПоРасходамУслугиАгента.Инвойс КАК Инвойс,
			|		ОтчетАгентаПоРасходамУслугиАгента.Документ КАК Документ,
			|		ОтчетАгентаПоРасходамУслугиАгента.Сумма КАК Сумма,
			|		ОтчетАгентаПоРасходамУслугиАгента.СуммаНДС КАК СуммаНДС
			|	ИЗ
			|		Документ.ОтчетАгентаПоРасходам.УслугиАгента КАК ОтчетАгентаПоРасходамУслугиАгента
			|	ГДЕ
			|		ОтчетАгентаПоРасходамУслугиАгента.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОтчетАгентаПоРасходамУслугиАгента.Ссылка,
			|		ОтчетАгентаПоРасходамУслугиАгента.Инвойс,
			|		ОтчетАгентаПоРасходамУслугиАгента.Документ,
			|		ОтчетАгентаПоРасходамУслугиАгента.Сумма,
			|		ОтчетАгентаПоРасходамУслугиАгента.СуммаНДС) КАК Расходы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВознаграждениеТЧ.Ссылка КАК Ссылка,
			|	ВознаграждениеТЧ.НоменклатураАгентская КАК НоменклатураНаименование,
			|	ВознаграждениеТЧ.НоменклатураАгентская.Артикул КАК НоменклатураАртикул,
			|	ВознаграждениеТЧ.НоменклатураАгентская.Код КАК НоменклатураКод,
			|	""шт"" КАК ЕдиницаИзмеренияНаименование,
			|	""796"" КАК ЕдиницаИзмеренияКод,
			|	"""" КАК НомерГТД,
			|	ВЫБОР
			|		КОГДА ВознаграждениеТЧ.НоменклатураАгентская.Услуга
			|			ТОГДА ""У""
			|		ИНАЧЕ ""Т""
			|	КОНЕЦ КАК Услуга,
			|	1 КАК Количество,
			|	ВознаграждениеТЧ.АгентскаяСумма КАК Цена,
			|	ВознаграждениеТЧ.АгентскаяСумма - ВЫБОР
			|		КОГДА ВознаграждениеТЧ.СуммаВключаетНДС
			|			ТОГДА ВознаграждениеТЧ.АгентскийНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаБезНДС,
			|	ВознаграждениеТЧ.АгентскийНДС КАК СуммаНДС,
			|	ВознаграждениеТЧ.АгентскаяСумма + ВЫБОР
			|		КОГДА ВознаграждениеТЧ.СуммаВключаетНДС
			|			ТОГДА 0
			|		ИНАЧЕ ВознаграждениеТЧ.АгентскийНДС
			|	КОНЕЦ КАК Сумма,
			|	ВознаграждениеТЧ.АгентскаяСтавкаНДС КАК СтавкаНДС,
			|	"""" КАК ИсхПоставщикНаименование,
			|	"""" КАК ИсхПоставщикИНН,
			|	"""" КАК ИсхПоставщикКПП
			|ИЗ
			|	Документ.ОтчетАгентаПоРасходам КАК ВознаграждениеТЧ
			|ГДЕ
			|	ВознаграждениеТЧ.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасходыТЧ.Инвойс,
			|	РасходыТЧ.Номенклатура,
			|	РасходыТЧ.Номенклатура.Артикул,
			|	РасходыТЧ.Номенклатура.Код,
			|	""шт"",
			|	""796"",
			|	"""",
			|	ВЫБОР
			|		КОГДА РасходыТЧ.Номенклатура.Услуга
			|			ТОГДА ""У""
			|		ИНАЧЕ ""Т""
			|	КОНЕЦ,
			|	РасходыТЧ.Количество,
			|	ВЫБОР
			|		КОГДА РасходыТЧ.Количество <> 0
			|			ТОГДА РасходыТЧ.Сумма / РасходыТЧ.Количество
			|		ИНАЧЕ РасходыТЧ.Сумма
			|	КОНЕЦ,
			|	РасходыТЧ.Сумма - ВЫБОР
			|		КОГДА РасходыТЧ.Ссылка.СуммаВключаетНДС
			|			ТОГДА РасходыТЧ.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	РасходыТЧ.СуммаНДС,
			|	РасходыТЧ.Сумма + ВЫБОР
			|		КОГДА РасходыТЧ.Ссылка.СуммаВключаетНДС
			|			ТОГДА 0
			|		ИНАЧЕ РасходыТЧ.СуммаНДС
			|	КОНЕЦ,
			|	РасходыТЧ.СтавкаНДС,
			|	ЕСТЬNULL(РасходыТЧ.Документ.Контрагент.Наименование, """"),
			|	ЕСТЬNULL(РасходыТЧ.Документ.Контрагент.ИНН, """"),
			|	ЕСТЬNULL(РасходыТЧ.Документ.Контрагент.КПП, """")
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОтчетАгентаПоРасходамУслугиАгента.Ссылка КАК Ссылка,
			|		ОтчетАгентаПоРасходамУслугиАгента.Инвойс КАК Инвойс,
			|		ОтчетАгентаПоРасходамУслугиАгента.Номенклатура КАК Номенклатура,
			|		ОтчетАгентаПоРасходамУслугиАгента.Количество КАК Количество,
			|		ОтчетАгентаПоРасходамУслугиАгента.СуммаНДС КАК СуммаНДС,
			|		ОтчетАгентаПоРасходамУслугиАгента.Документ КАК Документ,
			|		ОтчетАгентаПоРасходамУслугиАгента.Сумма КАК Сумма,
			|		ОтчетАгентаПоРасходамУслугиАгента.СтавкаНДС КАК СтавкаНДС
			|	ИЗ
			|		Документ.ОтчетАгентаПоРасходам.УслугиАгента КАК ОтчетАгентаПоРасходамУслугиАгента
			|	ГДЕ
			|		ОтчетАгентаПоРасходамУслугиАгента.Ссылка = &Ссылка) КАК РасходыТЧ";
			
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетКнигиПокупок") Тогда
			
		ТабПоступления = СсылкаНаОбъект.Суммы.Выгрузить();
		ТабПоступления.Свернуть("ПоступлениеТоваровИУслуг");
		МассивПоступлений = ТабПоступления.ВыгрузитьКолонку("ПоступлениеТоваровИУслуг");
		
		Если МассивПоступлений.Количество() > 0 И ЗначениеЗаполнено(МассивПоступлений[0]) Тогда	// Есть поступления
			
			Запрос.УстановитьПараметр("МассивПоступлений", МассивПоступлений);
			Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетКнигиПокупок.ПодразделениеОрганизации,
				|	СчетКнигиПокупок.КурсДокумента,
				|	СчетКнигиПокупок.ВалютаДокумента,
				|	СчетКнигиПокупок.СуммаДокументаСНДС КАК СуммаДокумента
				|ПОМЕСТИТЬ ВТ_СКП
				|ИЗ
				|	Документ.СчетКнигиПокупок КАК СчетКнигиПокупок
				|ГДЕ
				|	СчетКнигиПокупок.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СчетКнигиПокупокСуммы.ПоступлениеТоваровИУслуг,
				|	СУММА(ВЫБОР
				|			КОГДА СчетКнигиПокупокСуммы.ПоступлениеТоваровИУслуг.СуммаВключаетНДС
				|				ТОГДА СчетКнигиПокупокСуммы.СуммаСНДС
				|			ИНАЧЕ СчетКнигиПокупокСуммы.СуммаБезНДС
				|		КОНЕЦ) КАК Сумма,
				|	СУММА(СчетКнигиПокупокСуммы.СуммаНДС) КАК СуммаНДС
				|ПОМЕСТИТЬ ВТ_ДокТЧ
				|ИЗ
				|	Документ.СчетКнигиПокупок.Суммы КАК СчетКнигиПокупокСуммы
				|ГДЕ
				|	СчетКнигиПокупокСуммы.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	СчетКнигиПокупокСуммы.ПоступлениеТоваровИУслуг
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Док.Ссылка КАК Ссылка,
				|	Док.Дата КАК Дата,
				|	Док.Номер КАК Номер,
				|	Док.Организация КАК ОрганизацияСсылка,
				|	Док.Организация.Наименование КАК ОрганизацияНаименование,
				|	Док.Организация.ИНН КАК ОрганизацияИНН,
				|	ВЫБОР
				|		КОГДА ВТ_СКП.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|			ТОГДА ВТ_СКП.ПодразделениеОрганизации.КПП
				|		ИНАЧЕ Док.Организация.КПП
				|	КОНЕЦ КАК ОрганизацияКПП,
				|	Док.Контрагент КАК КонтрагентСсылка,
				|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
				|	Док.Контрагент.ИНН КАК КонтрагентИНН,
				|	Док.Контрагент.КПП КАК КонтрагентКПП,
				|	ВТ_СКП.ВалютаДокумента.Код КАК ВалютаКод,
				|	Док.ДоговорКонтрагента.Номер КАК ДоговорНомер,
				|	Док.ДоговорКонтрагента.Дата КАК ДоговорДата,
				|	ВТ_СКП.СуммаДокумента КАК СуммаДокумента,
				|	Док.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
				|	Док.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
				|	""Поступление"" КАК ТипДокумента
				|ИЗ
				|	ВТ_СКП КАК ВТ_СКП,
				|	Документ.ПоступлениеТоваровУслуг КАК Док
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокТЧ КАК ВТ_ДокТЧ
				|		ПО ВТ_ДокТЧ.ПоступлениеТоваровИУслуг = Док.Ссылка
				|ГДЕ
				|	Док.Ссылка В(&МассивПоступлений)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДанныеТЧ.Ссылка,
				|	ДанныеТЧ.НомерСтроки,
				|	ДанныеТЧ.НоменклатураНаименование,
				|	ДанныеТЧ.НоменклатураАртикул,
				|	ДанныеТЧ.НоменклатураКод,
				|	ДанныеТЧ.ЕдиницаИзмеренияНаименование,
				|	ДанныеТЧ.ЕдиницаИзмеренияКод,
				|	ДанныеТЧ.НомерГТД,
				|	ДанныеТЧ.Услуга,
				|	ДанныеТЧ.Количество,
				|	ВЫБОР
				|		КОГДА ВТ_СКП.КурсДокумента <> 0
				|			ТОГДА ВЫРАЗИТЬ(ДанныеТЧ.Цена / ВТ_СКП.КурсДокумента КАК ЧИСЛО(15, 2))
				|		ИНАЧЕ ДанныеТЧ.Цена
				|	КОНЕЦ КАК Цена,
				|	ВЫБОР
				|		КОГДА ВТ_СКП.КурсДокумента <> 0
				|			ТОГДА ВЫРАЗИТЬ(ДанныеТЧ.СуммаБезНДС / ВТ_СКП.КурсДокумента КАК ЧИСЛО(15, 2))
				|		ИНАЧЕ ДанныеТЧ.СуммаБезНДС
				|	КОНЕЦ КАК СуммаБезНДС,
				|	ВЫБОР
				|		КОГДА ВТ_СКП.КурсДокумента <> 0
				|			ТОГДА ВЫРАЗИТЬ(ДанныеТЧ.СуммаНДС / ВТ_СКП.КурсДокумента КАК ЧИСЛО(15, 2))
				|		ИНАЧЕ ДанныеТЧ.СуммаНДС
				|	КОНЕЦ КАК СуммаНДС,
				|	ВЫБОР
				|		КОГДА ВТ_СКП.КурсДокумента <> 0
				|			ТОГДА ВЫРАЗИТЬ(ДанныеТЧ.Сумма / ВТ_СКП.КурсДокумента КАК ЧИСЛО(15, 2))
				|		ИНАЧЕ ДанныеТЧ.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ДанныеТЧ.СтавкаНДС КАК СтавкаНДС
				|ИЗ
				|	(ВЫБРАТЬ
				|		ТоварыУслуги.Ссылка КАК Ссылка,
				|		ТоварыУслуги.НомерСтроки КАК НомерСтроки,
				|		ТоварыУслуги.НоменклатураНаименование КАК НоменклатураНаименование,
				|		ТоварыУслуги.НоменклатураАртикул КАК НоменклатураАртикул,
				|		ТоварыУслуги.НоменклатураКод КАК НоменклатураКод,
				|		ТоварыУслуги.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
				|		ТоварыУслуги.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
				|		ТоварыУслуги.НомерГТД КАК НомерГТД,
				|		ТоварыУслуги.Услуга КАК Услуга,
				|		ТоварыУслуги.Количество КАК Количество,
				|		ТоварыУслуги.Цена КАК Цена,
				|		ТоварыУслуги.Сумма - ВЫБОР
				|			КОГДА ТоварыУслуги.СуммаВключаетНДС
				|				ТОГДА ТоварыУслуги.СуммаНДС
				|			ИНАЧЕ 0
				|		КОНЕЦ КАК СуммаБезНДС,
				|		ТоварыУслуги.СуммаНДС КАК СуммаНДС,
				|		ТоварыУслуги.Сумма + ВЫБОР
				|			КОГДА ТоварыУслуги.СуммаВключаетНДС
				|				ТОГДА 0
				|			ИНАЧЕ ТоварыУслуги.СуммаНДС
				|		КОНЕЦ КАК Сумма,
				|		ТоварыУслуги.СтавкаНДС КАК СтавкаНДС
				|	ИЗ
				|		(ВЫБРАТЬ
				|			ТЧ.Ссылка КАК Ссылка,
				|			ТЧ.НомерСтроки КАК НомерСтроки,
				|			ТЧ.Номенклатура.Наименование КАК НоменклатураНаименование,
				|			ТЧ.Номенклатура.Артикул КАК НоменклатураАртикул,
				|			ТЧ.Номенклатура.Код КАК НоменклатураКод,
				|			ВЫБОР
				|				КОГДА ТЧ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
				|					ТОГДА ТЧ.ЕдиницаИзмерения.Наименование
				|				ИНАЧЕ ВЫБОР
				|						КОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
				|							ТОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование
				|						ИНАЧЕ ""шт""
				|					КОНЕЦ
				|			КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
				|			ВЫБОР
				|				КОГДА ТЧ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
				|					ТОГДА ТЧ.ЕдиницаИзмерения.Код
				|				ИНАЧЕ ВЫБОР
				|						КОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
				|							ТОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код
				|						ИНАЧЕ ""796""
				|					КОНЕЦ
				|			КОНЕЦ КАК ЕдиницаИзмеренияКод,
				|			"""" КАК НомерГТД,
				|			""Т"" КАК Услуга,
				|			ТЧ.Количество КАК Количество,
				|			ТЧ.Цена КАК Цена,
				|			ТЧ.СуммаНДС КАК СуммаНДС,
				|			ТЧ.Сумма КАК Сумма,
				|			ТЧ.СтавкаНДС КАК СтавкаНДС,
				|			ТЧ.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
				|		ИЗ
				|			Документ.ПоступлениеТоваровУслуг.Товары КАК ТЧ
				|		ГДЕ
				|			ТЧ.Ссылка В(&МассивПоступлений)
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			ТЧ.Ссылка,
				|			ТЧ.НомерСтроки,
				|			ТЧ.Номенклатура.Наименование,
				|			ТЧ.Номенклатура.Артикул,
				|			ТЧ.Номенклатура.Код,
				|			""шт"",
				|			""796"",
				|			"""",
				|			""У"",
				|			ТЧ.Количество,
				|			ТЧ.Цена,
				|			ТЧ.СуммаНДС,
				|			ТЧ.Сумма,
				|			ТЧ.СтавкаНДС,
				|			ТЧ.Ссылка.СуммаВключаетНДС
				|		ИЗ
				|			Документ.ПоступлениеТоваровУслуг.Услуги КАК ТЧ
				|		ГДЕ
				|			ТЧ.Ссылка В(&МассивПоступлений)) КАК ТоварыУслуги) КАК ДанныеТЧ,
				|	ВТ_СКП КАК ВТ_СКП";
				
			//РезультатЗапроса = Запрос.ВыполнитьПакет();
			//КоличествоЗапросов = РезультатЗапроса.Количество();
			//
			//ДанныеШапки = РезультатЗапроса[КоличествоЗапросов - 2].Выгрузить();
			//ДанныеДокумента.Вставить("ДанныеШапки", ДанныеШапки);
			//
			//ДанныеТЧ = РезультатЗапроса[КоличествоЗапросов - 1].Выгрузить();
			//ДанныеТЧРезультат = ДанныеТЧ.СкопироватьКолонки();
			//
			//ТаблицаПоступлений = ДанныеТЧ.Скопировать();
			//ТаблицаПоступлений.Свернуть("Ссылка");
			//
			//Для каждого ТекПоступление Из ТаблицаПоступлений Цикл
			//	СтрокиПоПоступлению = ДанныеТЧ.НайтиСтроки(Новый Структура("Ссылка", ТекПоступление.Ссылка));
			//	ТЧПоПоступлению = ДанныеТЧ.Скопировать(СтрокиПоПоступлению);
			//	
			//	ОсталосьРаспределитьСумма = ТЧПоПоступлению[0].СКПСумма;
			//	ОсталосьРаспределитьСуммаНДС = ТЧПоПоступлению[0].СКПСуммаНДС;
			//	ОбщСумма = ТЧПоПоступлению[0].СКПСумма;
			//	ОбщСуммаНДС = ТЧПоПоступлению[0].СКПСуммаНДС;
			//	ИтогСумма = ТЧПоПоступлению.Итог("Сумма");
			//	ИтогСуммаНДС = ТЧПоПоступлению.Итог("СуммаНДС");
			//	КоличествоСтрок = ТЧПоПоступлению.Количество();
			//	НомерСтроки = 1;
			//	Для каждого ТекСтрока Из ТЧПоПоступлению Цикл
			//		Если НомерСтроки < КоличествоСтрок Тогда
			//			Если ТЧПоПоступлению.Итог("Сумма") > 0 Тогда
			//				ТекСтрока.Сумма = Окр(ОбщСумма * ТекСтрока.Сумма / ИтогСумма, 2);
			//			Иначе
			//				ТекСтрока.Сумма = 0;
			//			КонецЕсли;
			//			Если ТЧПоПоступлению.Итог("СуммаНДС") > 0 Тогда
			//				ТекСтрока.СуммаНДС = Окр(ОбщСуммаНДС * ТекСтрока.СуммаНДС / ИтогСумма, 2);
			//			Иначе
			//				ТекСтрока.СуммаНДС = 0;
			//			КонецЕсли;
			//			ОсталосьРаспределитьСумма = ОсталосьРаспределитьСумма - ТекСтрока.Сумма;
			//			ОсталосьРаспределитьСуммаНДС = ОсталосьРаспределитьСуммаНДС - ТекСтрока.СуммаНДС;
			//		Иначе
			//			ТекСтрока.Сумма = ОсталосьРаспределитьСумма;
			//			ТекСтрока.СуммаНДС = ОсталосьРаспределитьСуммаНДС;
			//		КонецЕсли;
			//		Если ТекСтрока.Количество > 0 Тогда
			//			ТекСтрока.Цена = Окр(ТекСтрока.Сумма / ТекСтрока.Количество, 2);
			//		Иначе
			//			ТекСтрока.Цена = ТекСтрока.Сумма;
			//		КонецЕсли;
			//		ТекСтрока.СуммаБезНДС = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
			//		НомерСтроки = НомерСтроки + 1;
			//		НовСтрока = ДанныеТЧРезультат.Добавить();
			//		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			//	КонецЦикла;
			//КонецЦикла;
			//
			//ДанныеДокумента.Вставить("ДанныеТЧ", ДанныеТЧРезультат);
				
		Иначе
		
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Док.Ссылка КАК Ссылка,
				|	Док.Дата КАК Дата,
				|	Док.Номер КАК Номер,
				|	Док.Организация КАК ОрганизацияСсылка,
				|	Док.Организация.Наименование КАК ОрганизацияНаименование,
				|	Док.Организация.ИНН КАК ОрганизацияИНН,
				|	ВЫБОР
				|		КОГДА Док.ПодразделениеОрганизации <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|			ТОГДА Док.ПодразделениеОрганизации.КПП
				|		ИНАЧЕ Док.Организация.КПП
				|	КОНЕЦ КАК ОрганизацияКПП,
				|	Док.Контрагент КАК КонтрагентСсылка,
				|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
				|	Док.Контрагент.ИНН КАК КонтрагентИНН,
				|	Док.Контрагент.КПП КАК КонтрагентКПП,
				|	Док.ВалютаДокумента.Код КАК ВалютаКод,
				|	"""" КАК ДоговорНомер,
				|	ДАТАВРЕМЯ(1, 1, 1) КАК ДоговорДата,
				|	Док.СуммаДокументаСНДС КАК СуммаДокумента,
				|	Док.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
				|	Док.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
				|	""Поступление"" КАК ТипДокумента
				|ИЗ
				|	Документ.СчетКнигиПокупок КАК Док
				|ГДЕ
				|	Док.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧ.Ссылка КАК Ссылка,
				|	ТЧ.НомерСтроки КАК НомерСтроки,
				|	"""" КАК НоменклатураНаименование,
				|	"""" КАК НоменклатураАртикул,
				|	"""" КАК НоменклатураКод,
				|	""шт"" КАК ЕдиницаИзмеренияНаименование,
				|	""796"" КАК ЕдиницаИзмеренияКод,
				|	"""" КАК НомерГТД,
				|	""У"" КАК Услуга,
				|	1 КАК Количество,
				|	ТЧ.СуммаСНДС КАК Цена,
				|	ТЧ.СуммаБезНДС КАК СуммаБезНДС,
				|	ТЧ.СуммаНДС КАК СуммаНДС,
				|	ТЧ.СуммаСНДС КАК Сумма,
				|	ТЧ.СтавкаНДС КАК СтавкаНДС
				|ИЗ
				|	Документ.СчетКнигиПокупок.Суммы КАК ТЧ
				|ГДЕ
				|	ТЧ.Ссылка = &Ссылка
				|ИТОГИ
				|	СУММА(Количество),
				|	СУММА(СуммаБезНДС),
				|	СУММА(СуммаНДС),
				|	СУММА(Сумма)
				|ПО
				|	ОБЩИЕ";
				
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
		Запрос.УстановитьПараметр("Период", СсылкаНаОбъект.Дата);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Док.ДокументОснование
			|ПОМЕСТИТЬ ВТ_ДокРеквизиты
			|ИЗ
			|	Документ.СчетФактураВыданный КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Док.Ссылка КАК Ссылка,
			|	""СчетФактура"" КАК ТипДокумента,
			|	Док.Дата КАК Дата,
			|	Док.Номер КАК Номер,
			|	Док.Организация КАК ОрганизацияСсылка,
			|	Док.Организация.Наименование КАК ОрганизацияНаименование,
			|	Док.Организация.ИНН КАК ОрганизацияИНН,
			|	Док.Организация.КПП КАК ОрганизацияКПП,
			|	Док.Контрагент КАК КонтрагентСсылка,
			|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
			|	Док.Контрагент.ИНН КАК КонтрагентИНН,
			|	Док.Контрагент.КПП КАК КонтрагентКПП,
			|	Док.ВалютаДокумента.Код КАК ВалютаКод,
			|	Док.НомерИсправления КАК НомерИсправления,
			|	Док.ДокументОснование.Грузоотправитель КАК ГрузоотправительСсылка,
			|	Док.ДокументОснование.Грузоотправитель.Наименование КАК ГрузоотправительНаименование,
			|	Док.ДокументОснование.Грузополучатель КАК ГрузополучательСсылка,
			|	Док.ДокументОснование.Грузополучатель.Наименование КАК ГрузополучательНаименование,
			|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование, """") КАК РуководительФИО,
			|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование, """") КАК РуководительДолжность
			|ИЗ
			|	Документ.СчетФактураВыданный КАК Док
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
			|		ПО Док.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
			|ГДЕ
			|	Док.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыУслуги.НоменклатураНаименование,
			|	ТоварыУслуги.ЕдиницаИзмеренияКод,
			|	ТоварыУслуги.Количество,
			|	ТоварыУслуги.Цена,
			|	ТоварыУслуги.СтавкаНДС,
			|	ТоварыУслуги.Сумма - ВЫБОР
			|		КОГДА ТоварыУслуги.СуммаВключаетНДС
			|			ТОГДА ТоварыУслуги.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаБезНДС,
			|	ТоварыУслуги.СуммаНДС КАК СуммаНДС,
			|	ТоварыУслуги.Сумма + ВЫБОР
			|		КОГДА ТоварыУслуги.СуммаВключаетНДС
			|			ТОГДА 0
			|		ИНАЧЕ ТоварыУслуги.СуммаНДС
			|	КОНЕЦ КАК Сумма,
			|	ТоварыУслуги.СуммаАкциза,
			|	ТоварыУслуги.НомерГТД,
			|	ТоварыУслуги.СтранаПроисхожденияКод
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТЧ.Ссылка КАК Ссылка,
			|		ТЧ.Номенклатура.Наименование КАК НоменклатураНаименование,
			|		ВЫБОР
			|			КОГДА ТЧ.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|				ТОГДА ТЧ.ЕдиницаИзмерения.Код
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
			|						ТОГДА ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код
			|					ИНАЧЕ ""796""
			|				КОНЕЦ
			|		КОНЕЦ КАК ЕдиницаИзмеренияКод,
			|		ТЧ.Количество * ТЧ.Коэффициент КАК Количество,
			|		ТЧ.Цена КАК Цена,
			|		ТЧ.СтавкаНДС КАК СтавкаНДС,
			|		ТЧ.СуммаНДС КАК СуммаНДС,
			|		ТЧ.Сумма КАК Сумма,
			|		ТЧ.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
			|		0 КАК СуммаАкциза,
			|		ТЧ.НомерГТД.Код КАК НомерГТД,
			|		ТЧ.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод
			|	ИЗ
			|		Документ.РеализацияТоваровУслуг.Товары КАК ТЧ
			|	ГДЕ
			|		ТЧ.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_ДокРеквизиты.ДокументОснование
			|				ИЗ
			|					ВТ_ДокРеквизиты КАК ВТ_ДокРеквизиты)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТЧ.Ссылка,
			|		ТЧ.Номенклатура.Наименование,
			|		""796"",
			|		ТЧ.Количество,
			|		ТЧ.Цена,
			|		ТЧ.СтавкаНДС,
			|		ТЧ.СуммаНДС,
			|		ТЧ.Сумма,
			|		ТЧ.Ссылка.СуммаВключаетНДС,
			|		0,
			|		"""",
			|		""""
			|	ИЗ
			|		Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
			|	ГДЕ
			|		ТЧ.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_ДокРеквизиты.ДокументОснование
			|				ИЗ
			|					ВТ_ДокРеквизиты КАК ВТ_ДокРеквизиты)) КАК ТоварыУслуги";
			
	КонецЕсли;
	
	Если РезультатЗапроса = Неопределено Тогда
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		КоличествоЗапросов = РезультатЗапроса.Количество();
		
		ДанныеШапки = РезультатЗапроса[КоличествоЗапросов - 2].Выгрузить();
		ДанныеДокумента.Вставить("ДанныеШапки", ДанныеШапки);
		
		ДанныеТЧ = РезультатЗапроса[КоличествоЗапросов - 1].Выгрузить();
		ДанныеДокумента.Вставить("ДанныеТЧ", ДанныеТЧ);
		
	КонецЕсли;

	Возврат ДанныеДокумента;
	
КонецФункции

Процедура СозданиеПоступленийТКШ() Экспорт
	Если НЕ Константы.ИспользоватьКонтрольПроведения.Получить() Тогда
		Возврат;
	КонецЕсли;
	Прокси = КонтрольПроведенияСерверПовторноеИспользование.ПолучитьПрокси();
	
	Если Прокси = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Прокси.SendED();
	МассивОбработанных = Обработки.ЗагрузкаЭД.Загрузить(СериализаторXDTO.ПрочитатьXDTO(Результат));
	Если МассивОбработанных.Количество() Тогда
		ТипXDTOТипОбъекта = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array");   
		Объект = ФабрикаXDTO.Создать(ТипXDTOТипОбъекта);
		
		Для каждого текЭл из МассивОбработанных Цикл
			
			Объект.value.Добавить(текЭл);
			
		КонецЦикла;
		
		Ответ = Прокси.DeleteED(Объект);
	КонецЕсли;	

КонецПроцедуры

Процедура ДополнитьСтруктуруИдентификацииДокументаXDTO(СсылкаНаОбъект, СтруктураДанных) Экспорт
	
КонецПроцедуры

Процедура ОпределитьПоискПоДопИдентификатору(СтруктураДанных, СКП, Поступление) Экспорт
	
	Если ТипЗнч(СКП) = Тип("ДокументСсылка.СчетКнигиПокупок") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийСКП", СКП);
		Запрос.УстановитьПараметр("ПоступлениеТоваровИУслуг", Поступление);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетКнигиПокупокСуммы.Ссылка
			|ИЗ
			|	Документ.СчетКнигиПокупок.Суммы КАК СчетКнигиПокупокСуммы
			|ГДЕ
			|	СчетКнигиПокупокСуммы.Ссылка <> &ТекущийСКП
			|	И СчетКнигиПокупокСуммы.ПоступлениеТоваровИУслуг = &ПоступлениеТоваровИУслуг";
			
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			СтруктураДанных.Вставить("ПоискПоДоп");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
